Revit 2024 API
Transform2D.PostScale Method
 Scales both the linear and translational parts of this transformation and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public Transform2D PostScale(
	double scale
)
Visual Basic
Public Function PostScale ( _
	scale As Double _
) As Transform2D
Visual C++
public:
Transform2D^ PostScale(
	double scale
)
Parameters
scale
Type: System.Double
 The scale value.
Return Value
 Returns a pointer to "this" Transform2D.
Remarks
 The resulting transformation is equivalent to the application of this transformation and then the uniform scale, in this order.
See Also
Transform2D Class
Autodesk.Revit.DB Namespace